---
title: TriOrQuadFacet
classe: Autodesk.Revit.DB.TriOrQuadFacet
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# TriOrQuadFacet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `triOrQuadFacet.IsValidObject` | Boolean |
| `XYZ Normal { get; }` | `triOrQuadFacet.Normal` | XYZ |
| `Int32 NumberOfVertices { get; }` | `triOrQuadFacet.NumberOfVertices` | Int32 |
| `Void Dispose()` | `triOrQuadFacet.Dispose()` | Void |
| `Int32 GetVertexIndex(Int32)` | `triOrQuadFacet.GetVertexIndex(index)` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```